src/ChartsOfCharacteristicTypes/ОбщедоступныеРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ОбщедоступныеРеквизиты</Name>
			<Type>
				<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
				<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
				<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
				<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
				<v8:Type>cfg:DocumentRef.АктРассмотренияВозврата</v8:Type>
				<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
				<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатурыКонтрагентов</v8:Type>
				<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаявкаПокупателя</v8:Type>
				<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
				<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Отбор</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/ChartsOfCharacteristicTypes/ОбщедоступныеРеквизиты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСпискиРеквизитов()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиРеквизитов()
ИмяМетаданных = СтрЗаменить(Объект.ИмяПредопределенныхДанных,"_",".");	
ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ИмяМетаданных);
Для Каждого Реквизит  из ОбъектМетаданных.Реквизиты цикл 
Элементы.РеквизитыИмяРеквизита.СписокВыбора.Добавить(Реквизит.Имя,Реквизит.Синоним);	
Элементы.ОтборРеквизит.СписокВыбора.Добавить(Реквизит.Имя,Реквизит.Синоним);
КонецЦикла;

Для Каждого  ТабличнаяЧасть  из ОбъектМетаданных.ТабличныеЧасти цикл 
Элементы.РеквизитыИмяРеквизита.СписокВыбора.Добавить(ТабличнаяЧасть.Имя,ТабличнаяЧасть.Синоним);	
КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОтборЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
// не смог победить поэтому пока не реализовал

//ТекущиеДанные =   Элементы.Отбор.ТекущиеДанные;
//Если не  ТекущиеДанные = Неопределено тогда 

//Элемент.ДоступныеТипы =  ТипТекущегоРеквизита(ИмяМетаданных,ТекущиеДанные.Реквизит);
//Элемент.ВыбиратьТип  = ложь;



//КонецЕсли;

//	Элемент.ВыбиратьТип  = ложь;
//	
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Функция ТипТекущегоРеквизита(ИмяМетаданных,ИмяРеквизита)
	
ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ИмяМетаданных);

Возврат  ОбъектМетаданных.Реквизиты[ИмяРеквизита].Тип	;
	
	
КонецФункции
